export default
    {
        getProvince() {
            let array = [
                {
                    name: '人事行政部',
                    children: ['张婧', '吴志强', '王伊诺', '梁雪', '梁宇欣', '王微', '吴敬华', '张珊', '杨媛媛']
                },
                {
                    name: '财务中心',
                    children: ['王青川', '张艳艳', '张婧', '王方芳', '孟洁', '田禹', '周春晓', '周艳雨']
                },
                {
                    name: '总经办',
                    children: ['姬晓晨', '吴霞', '莫颂骄', '濮宁', '张秦婧']
                },
                {
                    name: '证券事务部',
                    children: ['薛龙', '朱玉坤', '杜浩然', '曲阳', '张杰']
                },
                {
                    name: '创新研发中心',
                    children: ['彭浩', '吉长江', '宋旭博', '宋波', '合敏慈', '李海燕', '秦浩达', '沈灿']
                },
                {
                    name: '产品研发中心',
                    children: ['胡水', '李春宾', '王迪森', '周鑫', '朱少鹏']
                },
                {
                    name: '产品研发中心',
                    children: ['冯伟峰', '樊硕', '魏志升', '王小龙', '任嫱', '张昊亮', '邓凯', '刘胜',
                        '齐立新', '魏玉超', '孙建飞', '李乐', '付莹', '申占坤', '康鹏', '李磊',
                        '刘鹏', '张亚莉', '刘伟'
                    ]
                },
                {
                    name: '商业产品运营中心',
                    children: ['蔡佳维', '陈浩', '金雪娇', '李蕾', '刘海洋', '刘思', '刘翔', '李研',
                        '孙冉', '王晓燕', '王玥', '文虹萱', '吴斌', '习威鹏', '叶秋元', '张晓漫',
                        '赵启朝'
                    ]
                },
                {
                    name: '品牌管理中心',
                    children: ['陈庶', '高莹', '陶玮', '张龙', '邹琳']
                },
                {
                    name: '营销中心',
                    children: ['陈浩', '冯春娇', '邓小燕', '刘征', '李馨淼', '杨媛媛', '陈兰', '池志晶',
                        '李苗苗', '汪守菊', '周海林'
                    ]
                },
                {
                    name: '媒资管理中心',
                    children: ['乔振宇', '位飒', '郭娅', '姜天', '孙迪', '张璨', '崔煜', '柳杨',
                        '杨晟', '罗辰', '张思曼', '严贝贝', '尹小号', '樊晓彤', '谭玉麒', '马思宏',
                        '王超楠', '王志', '许威'
                    ]
                },
                {
                    name: '无部门',
                    children: ['刘洪友', '王珊']
                },
            ]
            return array;
        }
    }





























































